Repository: massidea/site
Catalog: application/languages/account.tmx
Source language: fi
Languages: en

source: Valitse
en: Select status

source: Oletuskieli
en: Defaut Language

source: Kotimaa
en: Home country

source: (Kerro lyhyesti, kuka olet ja mitä olet tehnyt)
en: (Tell us shortly who you are and what you have done)

source: Lyhyt kuvaus
en: Bio

source: Lähetä käyttäjäkuva
en: Upload avatar image

source: Päivitä profiilisi
en: Update your personal profile

source: Lisätyt tiedot näytetään muille käyttäjille.
en: By default the filled information will be shown to other users.

source: Voit päivittää profiiliasi myöhemmin omalla profiilisivullasi näkyvän "muokkaa tiliä"-linkin kautta.
en: You can update your profile later on by clicking the edit profile link in your own user page.

source: Olet kirjautuneena sisään ja voit välittömästi aloittaa kommentoimisen ja sisällön lisäämisen.
en: You are logged in and you can immediately start commenting and adding content to Massidea.org.

source: Tilin luonti onnistui!
en: Signing up was successful!

source: kirjaimet
en: letters

source: Lataa uudelleen
en: Reload

source: Käyttäjän tiedot
en: Personal information

source: Tilin tiedot
en: Account information

source: Kirjaudu
en: Login

source: Tunnus
en: Username

source: Salasana
en: Password

source: Ole hyvä ja kirjaudu sisään käyttäen tunnustasi.
en: Please log in using your username and password.

source: Kenttä ei voi olla tyhjä!
en: Field must not be empty!

source: Unohdin salasanani
en: I forgot my password

source: Väärä käyttäjätunnus ja/tai salasana!
en: Wrong username and/or password!

source: Ongelmia kirjautumisessa?
en: Can't access your account?

source: Rekisteröidy:
en: Sign up:

source: Tämä kenttä on pakollinen
en: This is a required field

source: Sähköpostiosoite ei läpäissyt tarkastusta
en: Invalid e-mail address

source: Captcha-viestit eivät vastanneet
en: Captcha messages did not match

source: Käyttäjänimi ei kelpaa
en: Username is not valid

source: Kenttien sisältö täytyy olla sama.
en: Values must match.

source: Pakollinen
en: Mandatory

source: Sähköpostin hostname ei ole validi
en: E-mail hostname invalid

source: Liian lyhyt
en: Field too short

source: Liian pitkä
en: Field too long

source: Rekisteröityminen onnistui
en: Registration succesful

source: Rekisteröityminen...
en: Massidea.org registration...

source: Rekisteröiminen on ilmaista.
en: Registering with Massidea.org is free of charge.

source: Rekisteröityneet käyttäjät voivat julkaista sisältöjä, kommentoida, linkittää sisältöjä, antaa arvosanoja ja luoda oman profiilin.
en: Registered users can submit content, review and comment on content, add content-to-content links, rate content and create their own user profiles.

source: Pakolliset kentät ovat merkitty merkillä "*".
en: Fields marked with an "*" are required.

source: Oletuksena muille käyttäjille näytetään paikkakuntasi, mitään henkilötietoja ei näytetä.
en: By default only your location, no other personal information is shown to other users.

source: Voit lisätä lisätietoja profiiliisi rekisteröitymisen jälkeen!
en: You can add more information to your profile after registering!

source: Varmistuskysymystä ja -vastausta tarvitaan siinä tilanteessa, jos unohdat salasanasi. Salasanan unohtaessasi lähetä sähköpostilla käyttäjänimesi osoitteeseen oibs@tamk.fi. Kysymme sinulta lähettämällesi käyttäjänimelle kuuluvan varmistuskysymyksen, ja jos vastaat siihen oikein, resetoimme salasanasi ja lähetämme sinulle uuden.
en: The verification question and answer is needed when you forget your password. When you forget the password, you must send e-mail directly to oibs@tamk.fi containing your username. We will send you the corresponding secret question and if you answer that correctly, we will reset your password.

source: Etunimi
en: First name

source: Sukunimi
en: Family name

source: Kotikunta:
en: Hometown:

source: Olen
en: I am currently

source: Yksityisellä sektorilla
en: Private sector

source: Julkisella sektorilla
en: Public sector

source: Opetussektorilla
en: Education sector

source: Opiskelija
en: Student

source: Eläkkeellä
en: Pentioner

source: Jotakin muuta
en: Other

source: Käyttäjänimi:
en: Username:

source: Salasana:
en: Password:

source: Vahvista salasana:
en: Confirm password:

source: Sähköposti
en: Email address:

source: Vahvista sähköposti
en: Confirm e-mail address

source: Varmistus
en: Verification

source: Syötä teksti kuvasta:
en: Enter the letters above:

source: Sähköposti-ilmoitukset:
en: Email notifications:

source: Sisällön linkitykset
en: Content links

source: Viestit
en: Messages

source: Kommentit
en: Comments

source: Käyttäjänimi jo käytössä
en: Username already in use

source: Hyväksyn loppukäyttäjäehdot ja rekisteriselosteen
en: I agree to the services agreement and register description

source: Nykyinen salasana
en: Current password

source: Lähetä
en: Submit

source: Sukupuoli
en: Gender

source: Kuva...
en: Image

source: Rekisteröitynyt
en: Joined

source: Viimeksi kirjautunut
en: Last login

source: Ei koskaan
en: Never logged in

source: Muokkaa tiliä
en: Edit profile

source: Vaihda käyttäjäkuva
en: Change profile image

source: Käyttäjän luoma sisältö
en: Content by user

source: Kaikki
en: All

source: Haasteet
en: Challenges

source: Ideat
en: Ideas

source: Näkymät
en: Visions

source: Tallennetut
en: Saved

source: Käyttäjäryhmien
en: User Category

source: Ammatti
en: Profession

source: Yritys
en: Company

source: Kaupunki
en: City

source: Puhelin
en: Phone

source: Syntymäpäivä
en: Birthday

source: Elämäkerta
en: Biography

source: Maa
en: Country

source: Omaa sisältöä
en: Total Contents

source: Visiot
en: Future Infos

source: Ongelmat
en: Problems

source: Luotu
en: Posted

source: Katsottu
en: Views

source: Arvostelu
en: Ratings

source: Lähetä yksityisviesti
en: Send private message

source: Voit käyttää haussa % tai * jokerimerkkinä ja _ tai ? merkkiä yhden merkin korvausmerkkinä. Haku käyttää automaattisesti jokerimerkkejä tekstin molemmin puolin.
en: <span><strong>Guidelines to extend your search</strong></span><br> <p>You can substitute search term characters with any other characters by following these guidelines:</p> <p>Use % or * to replace multiple character,<br> Use _ or ? to replace single character. </p> <p><strong>Examples:</strong><br> *burg will result Saint Petersburg, Hamburg, etc.<br> *b?rg will result the same results as above, but it also includes cities like björneborg etc.</p>

source: Käyttäjät on järjestetty %s aakkosjärjestykseen käyttäjänimien mukaan.
en: Users are now sorted in %s alphabetical order by Usernames.

source: Käyttäjät on järjestetty %s järjestykseen käyttäjänimien mukaan.
en: Users are now sorted in %s order by their last login times.

source: Käyttäjä on lisännyt %s sisältöä.
en: User has added %s content.

source: Käyttäjän uusimmat sisällöt:
en: Users latest contents:

source: Käyttäjällä ei ole arvosteltuja sisältöjä:
en: User contents have not been rated.

source: Arvostelujen suhde:
en: Ratings ratio:

source: Arvostelujen keskiarvo:
en: Ratings avg.:

source: Liittynyt:
en: Joined:

source: Suomi
en: Finland

source: Käyttäjänimi
en: Username

source: Käyttäjällä
en: Users with

source: Enemmän kuin
en: More than

source: Vähemmän kuin
en: Less than

source: Tasan
en: Equal

source: sisältöä
en: content

source: Kaikki maat
en: All countries

source: Etsi
en: Search

source: Kirjaudu OpenID:llä
en: Login via OpenID

source: Tai käytä
en: Or use your

source: OpenID-tunnustasi
en: OpenID to login

source: OpenID-tunnus
en: OpenID-account

source: Tämä OpenID-tunnus on jo liitetty
en: This OpenID is already attached

source: OpenID-kirjautuminen
en: OpenID-login

source: Kirjaudu liitetyllä OpenID-tunnuksella
en: Login with attached OpenID

source: OpenID osoite
en: OpenID address

source: Kirjautuminen epäonnistui
en: Login failed

source: Salasanan vahvistus ei täsmää
en: Password confirmation does not match

source: Nykyinen salasana ei täsmää
en: Current password does not match

source: Julkinen
en: Public

source: Muokkaa profiilikuvaa
en: Edit profile thumbnail

source: Tallenna
en: Save
